// const str_6 = "吖(土)安(土)扒(水)朳(木)百(水)冰(水)并(水)臣(金)丞(金)吃(火)弛(火)充(土)舛(金)此(金)次(金)汆(金)存(金)打(火)凼(水)忉(火)氘(火)地(土)丢(金)多(火)朵(木)而(金)耳(火)伐(水)帆(水)泛(水)犯(水)仿(水)妃(水)份(水)缶(水)伏(水)旮(火)尬(木)圪(土)各(木)艮(土)亘(火)共(木)光(火)圭(土)亥(水)好(水)合(水)冱(水)灰(土)回(水)乩(木)圾(土)吉(木)岌(土)伎(木)奸(木)尖(火)幵(木)囝(木)件(木)匠(火)交(木)臼(木)决(火)伉(木)考(木)匡(木)夼(木)旯(火)老(火)耒(火)吏(金)列(金)劣(火)六(火)甪(火)米(水)纟(水)名(水)牟(水)氖(火)囡(火)年(火)乓(火)仳(水)圮(土)牝(水)乒(水)企(木)屺(土)犰(木)曲(木)全(火)任(金)扔(金)戎(木)肉(火)如(金)色(金)舌(金)式(金)收(水)守(金)戍(土)妁(金)死(金)寺(金)似(土)夙(金)她(火)汀(水)同(火)凸(金)吐(土)氽(火)佤(火)妄(火)危(水)圩(土)刎(金)仵(土)伍(土)西(金)吸(金)先(金)向(水)囟(金)刑(水)行(水)凶(水)匈(金)休(水)朽(木)戌(土)旭(木)吁(木)血(水)旬(金)伢(土)羊(土)仰(木)吆(火)曳(金)伊(土)衣(土)圯(土)夷(土)亦(土)屹(土)因(土)印(水)有(土)宇(土)羽(土)聿(木)再(金)在(金)早(金)咤(金)宅(火)兆(火)圳(土)汁(水)旨(火)至(火)仲(火)州(金)舟(金)朱(木)竹(木)字(金)自(火)";
// const str_9 = "炳(火)抶(火)抽(火)怛(火)待(火)怠(火)殆(火)眈(火)抵(火)帝(火)酊(火)订(火)段(火)祋(火)盹(火)盾(火)哆(火)哚(火)赴(火)拐(火)曷(火)烀(火)咴(火)姞(火)柬(火)炯(火)玦(火)俊(火)拉(火)厘(火)俚(火)俐(火)怜(火)亮(火)咧(火)拎(火)律(火)哪(火)娜(火)柰(火)耐(火)南(火)怒(火)虐(火)炮(火)炱(火)炭(火)畋(火)殄(火)亭(火)突(火)凃(火)拖(火)拓(火)歪(火)纨(火)肟(火)炫(火)紃(火)殃(火)徉(火)咬(火)映(火)昱(火)怨(火)灾(火)炸(火)招(火)昭(火)者(火)贞(火)政(火)祉(火)致(火)盅(火)重(火)纣(火)胄(火)炷(火)籽(火)秭(火)耔(火)奏(火)臿(金)查(金)姹(金)差(金)拆(金)怊(金)伡(金)疢(金)宬(金)怵(金)穿(金)舡(金)春(金)殂(金)促(金)毒(金)度(金)耏(金)钆(金)宫(金)剞(金)刭(金)俓(金)枯(金)前(金)怯(金)侵(金)秋(金)纫(金)肜(金)柔(金)砂(金)衫(金)舢(金)厍(金)哂(金)矧(金)甚(金)牲(金)省(金)施(金)食(金)室(金)是(金)首(金)姝(金)耍(金)帅(金)闩(金)思(金)娀(金)叟(金)俗(金)剃(金)祆(金)籼(金)庠(金)削(金)信(金)星(金)性(金)咻(金)庥(金)胥(金)叙(金)宣(金)页(金)钇(金)俞(金)俣(金)哉(金)昝(金)蚤(金)则(金)眨(金)咤(金)怔(金)咫(金)峙(金)肘(金)拄(金)拙(金)咨(金)姿(金)俎(金)昨(金)怍(金)柲(木)柄(木)柢(木)芏(木)俄(木)枹(木)尜(木)肝(木)柑(木)竿(木)疳(木)肛(木)缸(木)纥(木)革(木)虼(木)哏(木)狗(木)枸(木)牯(木)故(木)冠(木)咣(木)皈(木)轨(木)癸(木)柜(木)哄(木)訇(木)虹(木)芨(木)咭(木)级(木)急(木)纪(木)既(木)枷(木)叚(木)架(木)建(木)牮(木)姜(木)姣(木)皆(木)界(木)疥(木)蚧(木)矜(木)劲(木)扃(木)九(木)韭(木)拘(木)狙(木)拒(木)军(木)看(木)柯(木)科(木)咳(木)客(木)哐(木)柃(木)柳(木)咯(木)芒(木)怩(木)昵(木)拈(木)柈(木)芃(木)枰(木)祈(木)芑(木)契(木)恰(木)芊(木)俏(木)俅(木)酋(木)畎(木)芍(木)柿(木)柁(木)柝(木)芄(木)玩(木)侠(木)狎(木)柙(木)相(木)枵(木)彦(木)奕(木)弈(木)疫(木)羿(木)胤(木)柚(木)禺(木)竽(木)芋(木)栅(木)柘(木)枳(木)柱(木)斫(木)柞(木)疤(水)拔(水)拜(水)拌(水)保(水)抱(水)背(水)祊(水)甭(水)泵(水)毖(水)扁(水)窆(水)拚(水)便(水)昪(水)波(水)泊(水)勃(水)哺(水)怖(水)匆(水)沲(水)法(水)畈(水)飞(水)沸()狒(水)玢(水)风(水)封(水)凫(水)怫(水)拂(水)俘(水)氟(水)罘(水)拊(水)讣(水)负(水)泔(水)沽(水)哈(水)孩(水)河(水)很(水)红(水)泓(水)侯(水)后(水)厚(水)狐(水)怙(水)徊(水)奂(水)宦(水)皇(水)虺(水)哕(水)计(水)沮(水)炬(水)姥(水)泪(水)泠(水)泖(水)昴(水)冒(水)玫(水)眉(水)美(水)昧(水)虻(水)咪(水)弭(水)泌(水)沔(水)勉(水)眇(水)秒(水)咩(水)抿(水)泯(水)抹(水)哞(水)某(水)拇(水)泥(水)拍(水)哌(水)泮(水)叛(水)盼(水)狍(水)泡(水)疱(水)怦(水)抨(水)披(水)毗(水)姘(水)品(水)屏(水)泼(水)匍(水)柒(水)泣(水)泅(水)泉(水)染(水)娆(水)沭(水)泗(水)沱(水)咸(水)香(水)巷(水)泄(水)卸(水)泫(水)泶(水)妍(水)沿(水)泱(水)盈(水)泳(水)油(水)沾(水)沼(水)治(水)注(水)哀(土)垵(土)拗(土)砭(土)垞(土)衩(土)昶(土)垤(土)垌(土)峒(土)肚(土)砘(土)垛(土)垩(土)垡(土)垓(土)垢(土)砍(土)奎(土)趴(土)怕(土)盆(土)砒(土)垧(土)哇(土)娃(土)威(土)韦(土)畏(土)胃(土)瓮(土)屋(土)侮(土)型(土)砉(土)峋(土)押(土)垭(土)娅(土)砑(土)咽(土)匽(土)怏(土)垚(土)姚(土)要(土)咿(土)怡(土)咦(土)姨(土)舣(土)姻(土)音(土)垠(土)俑(土)勇(土)幽(土)疣(土)羑(土)囿(土)宥(土)纡(土)舁(土)禹(土)垣(土)爰(土)约(土)玥(土)窀(土)";
strings = {
    3 : "才(金)叉(金)彳(火)亍(金)川(金)寸(金)大(火)凡(水)干(木)工(木)弓(木)及(木)丌(木)己(土)孑(木)巾(木)久(木)孓(火)口(木)廿(木)女(火)乞(木)千(金)刃(金)三(金)山(土)上(金)勺(火)尸(金)士(金)巳(火)土(土)乇(火)丸(土)亡(水)兀(土)夕(金)下(水)彡(木)小(金)丫(土)幺(火)也(土)已(木)弋(火)尢(土)于(土)丈(火)子(水)",
    4 : "卬(土)夭(土)巴(水)比(水)卞(木)不(水)尺(火)仇(金)歹(水)丹(火)吊(火)仃(火)斗(火)厄(土)乏(金)反(水)方(水)分(水)夫(水)父(水)丐(木)戈(金)公(木)勾(木)互(水)户(水)化(水)幻(水)火(火)介(木)今(木)斤(木)井(火)亢(木)孔(木)仂(火)毛(水)木(木)内(火)牛(木)丬(水)匹(水)片(水)亓(木)欠(木)切(土)犬(木)仁(金)壬(水)仍(金)日(火)冗(金)卅(水)少(金)升(金)什(金)氏(金)手(金)殳(金)水(水)四(金)太(火)天(火)屯(火)王(土)文(水)毋(水)午(火)勿(水)兮(金)心(金)牙(木)爻(火)刈(金)尹(土)引(土)尤(土)友(土)予(土)元(木)曰(土)月(木)匀(木)允(土)仄(金)仉(火)之(火)支(火)止(火)中(火)爪(金)",
    5 : "凹(土)叭(水)白(水)半(水)包(水)北(水)本(木)必(水)弁(水)丙(火)卟(水)布(水)册(金)叱(金)斥(金)出(金)代(火)旦(火)叨(火)氐(火)叼(金)叮(火)冬(火)弗(水)付(水)尕(木)甘(木)仡(木)功(木)古(木)瓜(木)宄(木)夯(水)禾(水)弘(水)乎(水)卉(木)加(木)甲(木)叫(木)巨(木)句(木)卡(木)刊(金)尻(金)可(木)叩(木)叻(火)立(火)尥(火)令(火)另(火)矛(水)卯(木)民(水)皿(水)末(水)母(水)仫(水)目(水)奶(火)尼(火)奴(火)丕(水)皮(水)氕(水)平(水)叵(水)仟(金)巧(木)且(金)丘(木)囚(木)去(木)冉(火)仞(金)仨(水)申(金)生(金)史(金)矢(金)世(金)仕(金)市(金)示(金)石(金)失(金)甩(金)司(金)玊(金)他(火)它(火)田(火)仝(火)瓦(土)外(木)未(木)五(木)戊(土)硅(土)仙(金)兄(水)玄(水)穴(水)疋(水)央(土)以(土)永(土)用(土)由(土)右(土)幼(土)玉(木)孕(土)匝(水)札(木)乍(金)占(金)仗(火)召(火)正(金)只(火)主(金)仔(土)左(火)",
    6 : "安(土)百(水)冰(水)并(水)臣(金)丞(金)吃(火)弛(火)充(土)存(金)凼(水)忉(火)氘(火)地(土)丢(金)多(火)朵(木)而(金)耳(火)伐(水)帆(水)泛(水)犯(水)仿(水)妃(水)份(水)缶(水)伏(水)圪(土)艮(土)亘(火)共(木)光(火)圭(土)亥(水)好(水)合(水)回(水)吉(木)岌(土)伎(木)幵(木)匠(火)交(木)决(火)伉(木)考(木)匡(木)旯(火)老(火)吏(金)列(金)六(火)米(水)名(水)牟(水)氖(火)年(火)乒(水)企(木)屺(土)曲(木)全(火)任(金)扔(金)戎(木)肉(火)如(金)色(金)舌(金)式(金)收(水)守(金)戍(土)妁(金)寺(金)似(土)她(火)汀(水)同(火)凸(金)氽(火)佤(火)圩(土)仵(土)伍(土)西(金)吸(金)先(金)向(水)行(水)匈(金)休(水)朽(木)戌(土)旭(木)吁(木)旬(金)羊(土)仰(木)曳(金)伊(土)衣(土)圯(土)夷(土)亦(土)屹(土)因(土)印(水)有(土)宇(土)羽(土)聿(木)再(金)在(金)早(金)咤(金)宅(火)兆(火)圳(土)汁(水)旨(火)至(火)仲(火)州(金)舟(金)朱(木)竹(木)字(金)自(火)",
    7 : "犴(火)呈(火)辵(火)呔(火)甙(火)但(火)低(火)弟(火)佃(火)甸(火)玎(火)疔(火)盯(火)豆(火)囤(火)旰(火)灸(火)牢(火)李(火)利(火)良(火)吝(火)伶(火)吕(火)卵(火)免(火)男(火)呐(火)佞(火)弄(火)努(火)求(火)忐(火)忑(火)町(火)廷(火)佟(火)彤(火)吞(火)托(火)佗(火)妥(火)巫(火)妖(火)佁(火)佔(火)志(火)豸(火)住(火)灼(火)姊(火)足(火)扱(金)岔(金)吵(金)车(金)成(金)赤(金)氚(金)串(金)吹(金)忖(金)兑(金)判(金)七(金)吣(金)忍(金)妊(金)礽(金)删(金)劭(金)佘(金)伸(金)身(金)束(金)吮(金)私(金)伺(金)兕(金)姒(金)宋(金)忒(金)吻(金)伭(金)辛(金)秀(金)序(金)巡(金)酉(金)皂(金)卮(金)吱(金)伫(金)助(金)妆(金)壮(金)孜(金)走(金)佐(金)作(金)坐(金)杓(木)材(木)岑(木)杈(木)床(木)村(木)杜(木)呃(木)伽(木)改(木)杆(木)杠(木)告(木)更(木)攻(木)估(木)谷(木)庋(木)呙(木)囯(木)旱(木)何(木)吼(木)肓(木)*(木)忌(木)夹(木)见(木)角(木)疖(木)劫(木)妗(木)究(木)局(木)姖(木)君(木)佧(木)扛(木)囥(木)壳(木)克(木)扣(木)困(木)伲(木)你(木)杞(木)扦(木)羌(木)劬(木)却(木)杉(木)我(木)吴(木)吾(木)扤(木)杌(木)匣(木)吓(木)杏(木)言(木)吟(木)杖(木)吧(水)夿(水)弝(水)伴(水)贝(水)伻(水)皀(水)佊(水)吡(水)*(水)庇(水)别(水)兵(水)伯(水)孛(水)吥(水)步(水)汊(水)池(水)汎(水)妨(水)彷(水)吠(水)吩(水)佛(水)否(水)呋(水)孚(水)甫(水)汞(水)佝(水)含(水)罕(水)汗(水)亨(水)宏(水)囫(水)弧(水)汲(水)即(水)江(水)戒(水)况(水)冷(水)忙(水)尨(水)每(水)芈(水)妙(水)尿(水)妞(水)伾(水)屁(水)汝(水)汕(水)汜(水)忘(水)尾(水)污(水)汐(水)希(水)孝(水)形(水)汛(水)妤(水)妘(水)岙(土)岜(土)坂(土)坌(土)辰(土)坊(土)坩(土)均(土)坎(土)坑(土)牡(土)圻(土)岐(土)岍(土)坍(土)秃(土)完(土)位(土)圬(土)氙(土)岘(土)呀(土)岈(土)延(土)冶(土)矣(土)佚(土)役(土)邑(土)吲(土)甬(土)攸(土)卣(土)佑(土)余(土)欤(土)玙(土)址(土)",
    8 : "哎(火)佰(火)长(火)炒(火)坼(火)侈(火)炊(火)佽(火)徂(火)耷(火)妲(火)沓(火)岱(火)宕(火)到(火)的(火)狄(火)底(火)玓(火)典(火)店(火)耵(火)定(火)咚(火)侗(火)抖(火)妒(火)咄(火)剁(火)佴(火)昉(火)炅(火)昊(火)戽(火)姐(火)咎(火)抉(火)炕(火)昆(火)剌(火)来(火)佬(火)肋(火)例(火)戾(火)两(火)冽(火)囹(火)呤(火)侣(火)仑(火)旻(火)奈(火)呶(火)妮(火)念(火)弩(火)疟(火)妾(火)炔(火)乳(火)侍(火)帑(火)弢(火)忝(火)佻(火)帖(火)投(火)罔(火)昕(火)炎(火)佯(火)易(火)找(火)争(火)知(火)直(火)制(火)帙(火)炙(火)忠(火)隹(火)卓(火)侘(金)昌(金)抄(金)弨(金)扯(金)忱(金)承(金)忡(金)沖(金)初(金)垂(金)佌(金)刺(金)儿(金)庚(金)刮(金)戋(金)金(金)净(金)侃(金)刻(金)孥(金)妻(金)戕(金)青(金)取(金)叁(金)刹(金)姗(金)疝(金)尚(金)舍(金)社(金)侁(金)呻(金)使(金)始(金)事(金)受(金)抒(金)叔(金)刷(金)祀(金)忪(金)怂(金)所(金)兔(金)昔(金)穸(金)些(金)姓(金)刖(金)甾(金)昃(金)怎(金)咋(金)轧(金)侄(金)忮(金)周(金)妯(金)咒(金)宙(金)侏(金)抓(金)宗(金)卒(金)昂(木)枊(木)板(木)杯(木)杵(木)东(木)妸(木)扼(木)枋(木)斧(木)秆(木)杲(木)疙(木)供(木)咕(木)姑(木)孤(木)固(木)呱(木)乖(木)官(木)果(木)杭(木)忽(木)昏(木)肌(木)亟(木)佶(木)技(木)季(木)佳(木)肩(木)艽(木)佼(木)届(木)卺(木)京(木)纠(木)赳(木)玖(木)疚(木)居(木)咀(木)具(木)卷(木)咔(木)咖(木)抗(木)肯(木)空(木)快(木)狂(木)林(木)枚(木)杪(木)艿(木)呢(木)杻(木)杷(木)枇(木)其(木)奇(木)歧(木)穹(木)虬(木)屈(木)券(木)枘(木)松(木)枉(木)卧(木)析(木)呷(木)欣(木)芎(木)厓(木)兖(木)杳(木)宜(木)枕(木)枝(木)竺(木)杼(木)岸(水)八(水)把(水)爸(水)扳(水)攽(水)版(水)扮(水)姅(水)孢(水)卑(水)*(水)沘(水)彼(水)畀(水)忭(水)抃(水)汳(水)汴(水)表(水)秉(水)幷(水)帛(水)瓝(水)沉(水)沌(水)泛(水)房(水)放(水)非(水)氛(水)汾(水)忿(水)奉(水)扶(水)府(水)咐(水)阜(水)侅(水)冈(水)汩(水)卦(水)沆(水)呵(水)劾(水)和(水)佫(水)呼(水)虎(水)或(水)泐(水)盲(水)牦(水)没(水)妹(水)门(水)氓(水)孟(水)汨(水)宓(水)明(水)命(水)殁(水)沫(水)侔(水)姆(水)沐(水)牧(水)忸(水)扭(水)狃(水)抛(水)咆(水)庖(水)呸(水)沛(水)佩(水)帔(水)朋(水)批(水)沏(水)汔(水)汽(水)沁(水)沙(水)沈(水)汰(水)汪(水)味(水)汶(水)沃(水)武(水)物(水)弦(水)冼(水)享(水)协(水)忻(水)幸(水)汹(水)沂(水)雨(水)沅(水)咂(水)沚(水)状(水)艾(土)坳(土)垇(土)坻(土)坫(土)矾(土)附(土)矸(土)岣(土)岵(土)岬(土)坷(土)岢(土)坤(土)垃(土)峁(土)岷(土)坭(土)爬(土)帕(土)坢(土)坯(土)坪(土)坡(土)坦(土)坨(土)宛(土)往(土)旺(土)委(土)忤(土)岫(土)盱(土)亚(土)奄(土)肴(土)夜(土)依(土)抑(土)佾(土)咏(土)呦(土)侑(土)於(土)盂(土)臾(土)昀(土)狁(土)",
    9 : "炳(火)怛(火)待(火)眈(火)抵(火)帝(火)酊(火)订(火)段(火)祋(火)盹(火)盾(火)哆(火)哚(火)赴(火)拐(火)曷(火)烀(火)咴(火)姞(火)柬(火)炯(火)玦(火)俊(火)拉(火)厘(火)俚(火)俐(火)怜(火)亮(火)咧(火)拎(火)律(火)哪(火)娜(火)柰(火)耐(火)南(火)怒(火)虐(火)炮(火)炱(火)炭(火)畋(火)殄(火)亭(火)突(火)凃(火)拖(火)拓(火)歪(火)纨(火)肟(火)炫(火)徉(火)咬(火)映(火)昱(火)灾(火)炸(火)招(火)昭(火)者(火)贞(火)政(火)祉(火)致(火)重(火)纣(火)炷(火)奏(火)臿(金)查(金)差(金)怊(金)伡(金)穿(金)舡(金)春(金)促(金)毒(金)度(金)耏(金)钆(金)宫(金)刭(金)前(金)秋(金)纫(金)肜(金)柔(金)砂(金)衫(金)舢(金)甚(金)牲(金)省(金)施(金)食(金)室(金)是(金)首(金)姝(金)耍(金)帅(金)闩(金)思(金)娀(金)叟(金)俗(金)剃(金)祆(金)籼(金)庠(金)削(金)信(金)星(金)庥(金)胥(金)叙(金)宣(金)页(金)钇(金)俞(金)俣(金)哉(金)昝(金)则(金)眨(金)咤(金)怔(金)咫(金)峙(金)肘(金)咨(金)姿(金)昨(金)柄(木)柢(木)芏(木)俄(木)枹(木)竿(木)缸(木)纥(木)革(木)虼(木)哏(木)狗(木)枸(木)牯(木)故(木)冠(木)咣(木)皈(木)轨(木)癸(木)柜(木)哄(木)訇(木)虹(木)芨(木)咭(木)级(木)急(木)纪(木)既(木)枷(木)叚(木)架(木)建(木)牮(木)姜(木)姣(木)皆(木)界(木)疥(木)蚧(木)矜(木)劲(木)扃(木)九(木)韭(木)拘(木)狙(木)拒(木)军(木)看(木)柯(木)科(木)客(木)柃(木)柳(木)咯(木)芒(木)怩(木)昵(木)拈(木)柈(木)芃(木)枰(木)祈(木)芑(木)契(木)恰(木)芊(木)俏(木)俅(木)酋(木)畎(木)芍(木)柿(木)柁(木)柝(木)芄(木)玩(木)侠(木)狎(木)柙(木)相(木)枵(木)彦(木)奕(木)弈(木)疫(木)羿(木)胤(木)柚(木)禺(木)竽(木)芋(木)栅(木)柘(木)枳(木)柱(木)斫(木)柞(木)拔(水)拜(水)拌(水)保(水)抱(水)背(水)祊(水)甭(水)泵(水)毖(水)扁(水)窆(水)拚(水)便(水)昪(水)波(水)泊(水)勃(水)哺(水)怖(水)匆(水)沲(水)法(水)畈(水)飞(水)沸()狒(水)玢(水)风(水)封(水)凫(水)怫(水)拂(水)俘(水)氟(水)罘(水)拊(水)讣(水)负(水)泔(水)沽(水)哈(水)孩(水)河(水)很(水)红(水)泓(水)侯(水)后(水)厚(水)狐(水)怙(水)徊(水)奂(水)宦(水)皇(水)虺(水)哕(水)计(水)沮(水)炬(水)姥(水)泪(水)泠(水)泖(水)昴(水)冒(水)玫(水)眉(水)美(水)昧(水)虻(水)咪(水)弭(水)泌(水)沔(水)勉(水)眇(水)秒(水)咩(水)抿(水)泯(水)抹(水)哞(水)某(水)拇(水)泥(水)拍(水)哌(水)泮(水)叛(水)盼(水)狍(水)泡(水)疱(水)怦(水)抨(水)披(水)毗(水)姘(水)品(水)屏(水)泼(水)匍(水)柒(水)泣(水)泅(水)泉(水)染(水)娆(水)沭(水)泗(水)沱(水)咸(水)香(水)巷(水)泄(水)卸(水)泫(水)泶(水)妍(水)沿(水)泱(水)盈(水)泳(水)油(水)沾(水)沼(水)治(水)注(水)哀(土)垵(土)拗(土)砭(土)垞(土)衩(土)昶(土)垤(土)垌(土)峒(土)肚(土)砘(土)垛(土)垩(土)垡(土)垓(土)垢(土)砍(土)奎(土)趴(土)怕(土)盆(土)砒(土)垧(土)哇(土)娃(土)威(土)韦(土)畏(土)胃(土)瓮(土)屋(土)侮(土)型(土)砉(土)峋(土)押(土)垭(土)娅(土)砑(土)咽(土)匽(土)怏(土)垚(土)姚(土)要(土)咿(土)怡(土)咦(土)姨(土)舣(土)姻(土)音(土)垠(土)俑(土)勇(土)幽(土)疣(土)羑(土)囿(土)宥(土)纡(土)舁(土)禹(土)垣(土)爰(土)约(土)玥(土)窀(土)",
    10 : "哧(火)耻(火)翀(火)娖(火)玳(火)耽(火)疸(火)紞(火)岛(火)倒(火)娣(火)玷(火)爹(火)瓞(火)冻(火)恫(火)蚪(火)趸(火)耿(火)烘(火)恍(火)疾(火)晋(火)珏(火)倔(火)烤(火)朗(火)烙(火)哩(火)娌(火)俩(火)凉(火)料(火)烈(火)玲(火)瓴(火)凌(火)留(火)旅(火)伦(火)倮(火)耄(火)拿(火)纳(火)肭(火)衲(火)孬(火)能(火)娘(火)恧(火)衄(火)哦(火)秦(火)恁(火)朊(火)芮(火)蚋(火)偌(火)晒(火)晌(火)恕(火)朔(火)趿(火)肽(火)泰(火)唐(火)倘(火)讨(火)套(火)特(火)疼(火)屉(火)倜(火)恬(火)挑(火)条(火)庭(火)挺(火)徒(火)彖(火)庹(火)挖(火)挝(火)倭(火)乌(火)娭(火)夏(火)畜(火)烜(火)讯(火)迅(火)秧(火)烊(火)窈(火)舀(火)旃(火)展(火)站(火)珍(火)朕(火)肢(火)值(火)秩(火)舯(火)衷(火)冢(火)祝(火)倬(火)笫(火)恣(火)剥(金)财(金)睬(金)仓(金)敇(金)豺(金)刬(金)伥(金)倡(金)鬯(金)晁(金)眧(金)耖(金)唓(金)宸(金)乘(金)蚩(金)持(金)翅(金)刍(金)俶(金)纯(金)祠(金)脆(金)厝(金)凋(金)钉(金)珐(金)刚(金)罡(金)剐(金)怪(金)借(金)峻(金)钌(金)倪(金)钋(金)剖(金)倩(金)挈(金)邛(金)讱(金)轫(金)衽(金)狨(金)辱(金)弱(金)珊(金)闪(金)讪(金)剡(金)扇(金)哨(金)射(金)珅(金)娠(金)神(金)眚(金)师(金)十(金)时(金)拾(金)狩(金)书(金)纾(金)殊(金)衰(金)拴(金)素(金)祟(金)孙(金)隼(金)唆(金)索(金)恸(金)剜(金)紊(金)唏(金)息(金)席(金)掀(金)宵(金)笑(金)修(金)脩(金)訏(金)徐(金)痃(金)眩(金)殉(金)栽(金)宰(金)奘(金)唣(金)哳(金)痄(金)窄(金)钊(金)针(金)真(金)畛(金)疹(金)拯(金)症(金)纸(金)指(金)酎(金)疰(金)拽(金)酌(金)租(金)祖(金)祚(金)唑(金)座(金)桉(木)芭(木)笆(木)柏(木)栢(木)梆(木)苄(木)栟(木)柴(木)屙(木)婀(木)苊(木)芳(木)芬(木)粉(木)芙(木)酐(木)绀(木)羔(木)高(木)哥(木)格(木)鬲(木)哿(木)根(木)耕(木)哽(木)肱(木)恭(木)蚣(木)躬(木)拱(木)贡(木)股(木)骨(木)罟(木)挂(木)倌(木)桄(木)鬼(木)桂(木)衮(木)核(木)桁(木)讧(木)笏(木)花(木)桓(木)恢(木)唧(木)姬(木)屐(木)笄(木)笈(木)脊(木)记(木)珈(木)家(木)痂(木)恝(木)兼(木)豇(木)狡(木)讦(木)拮(木)桀(木)芥(木)衿(木)肼(木)弪(木)径(木)柩(木)桕(木)疽(木)桔(木)俱(木)倨(木)娟(木)倦(木)桊(木)隽(木)拷(木)栲(木)珂(木)疴(木)恪(木)倥(木)恐(木)芤(木)哭(木)库(木)框(木)括(木)栝(木)栳(木)栗(木)匿(木)臬(木)耙(木)芘(木)栖(木)芪(木)耆(木)岂(木)起(木)气(木)虔(木)肷(木)芡(木)衾(木)芩(木)芹(木)祛(木)拳(木)缺(木)桑(木)芟(木)秫(木)栓(木)凇(木)笋(木)桃(木)桐(木)砼(木)桅(木)芴(木)奚(木)哮(木)校(木)芯(木)栩(木)桠(木)芽(木)芫(木)唁(木)苡(木)倚(木)痈(木)邕(木)娱(木)圄(木)峪(木)原(木)纭(木)芸(木)笊(木)芝(木)祗(木)芷(木)桎(木)株(木)桌(木)氨(水)粑(水)呗(水)班(水)般(水)舨(水)豹(水)趵(水)倍(水)倴(水)畚(水)秕(水)俾(水)舭(水)珌(水)髟(水)俵(水)病(水)玻(水)砵(水)亳(水)庯(水)秤(水)臭(水)泚(水)洞(水)娥(水)洱(水)肪(水)纺(水)舫(水)肥(水)匪(水)肺(水)纷(水)峰(水)俸(水)服(水)祓(水)蚨(水)俯(水)釜(水)害(水)氦(水)蚶(水)邗(水)函(水)航(水)耗(水)盍(水)狠(水)恨(水)哼(水)恒(水)洪(水)候(水)祜(水)洹(水)洄(水)恚(水)活(水)洎(水)浃(水)津(水)酒(水)洌(水)洛(水)马(水)邙(水)旄(水)们(水)勐(水)洣(水)敉(水)秘(水)眠(水)眄(水)珉(水)秣(水)毪(水)亩(水)纽(水)俳(水)派(水)畔(水)袢(水)旁(水)配(水)疲(水)蚍(水)拼(水)娉(水)俜(水)洴(水)珀(水)哱(水)圃(水)凄(水)讫(水)迄(水)洽(水)洳(水)洒(水)杀(水)纱(水)娑(水)洮(水)洼(水)洧(水)纹(水)蚊(水)务(水)洗(水)效(水)胁(水)绁(水)洩(水)屑(水)恤(水)洫(水)恂(水)洵(水)训(水)衍(水)洋(水)洇(水)耘(水)拶(水)洲(水)洙(水)浊(水)啊(土)唉(土)埃(土)砹(土)鹌(土)俺(土)按(土)案(土)盎(土)敖(土)芺(土)峬(土)城(土)埕(土)砥(土)峨(土)恩(土)砝(土)砩(土)个(土)埂(土)埚(土)砬(土)埒(土)埋(土)砰(土)破(土)埔(土)砌(土)峭(土)窃(土)容(土)埏(土)砷(土)堍(土)砣(土)娓(土)翁(土)唔(土)阢(土)峡(土)轩(土)蚜(土)氩(土)恹(土)胭(土)宴(土)晏(土)氧(土)恙(土)眙(土)酏(土)益(土)殷(土)氤(土)蚓(土)祐(土)迂(土)邘(土)育(土)彧(土)眢(土)员(土)袁(土)砸(土)砟(土)砧(土)肫(土)",
}

const transStrToArr = function(str){
    var arr1 = str.split(')');
    var _arr = [];
    for(var i = 0; i < arr1.length; i++){
        var arrItem = arr1[i].split("(");
        if(arrItem[0]){
            _arr.push({
                name: arrItem[0],
                type: arrItem[1],
            })
        }
    }
    return _arr
}
const kangxi = {}
kangxi.kxString = function(num){
    return transStrToArr(strings[num])
}
kangxi.kxHua = [{
    value:"1", 
    label:"1画"
},{
    value:"2", 
    label:"2画"
},{
    value:"3", 
    label:"3画"
},{
    value:"4", 
    label:"4画"
},{
    value:"5", 
    label:"5画"
},{
    value:"6", 
    label:"6画"
},{
    value:"7", 
    label:"7画"
},{
    value:"8", 
    label:"8画"
},{
    value:"9", 
    label:"9画"
},{
    value:"10", 
    label:"10画"
},]
kangxi.kxWuxing = [
        {value:"", label:"无"},
        {value:"金", label:"金"},
        {value:"木", label:"木"},
        {value:"水", label:"水"},
        {value:"火", label:"火"},
        {value:"土", label:"土"}
    ]

module.exports = kangxi